{
    "andhrapradesh": {
      "title": "Andhra Pradesh - GeoLearn",
      "videoUrl": "https://www.youtube.com/embed/WQGsthUAcxY?si=y7g0jbZU7QyBUdns",
      "info": "Andhra Pradesh, located in the southeastern part of India, is a vibrant state known for its rich cultural heritage, historical landmarks, and scenic landscapes. Bordered by the Bay of Bengal to the east, it boasts a long coastline, making it one of the leading states in maritime trade. The capital city, Amaravati, is being developed as a modern hub, while cities like Visakhapatnam and Vijayawada play crucial roles in the state’s economy. Andhra Pradesh is also famous for its classical dance form Kuchipudi, spicy cuisine, and ancient temples that reflect its deep-rooted traditions. With a blend of agriculture, industry, and information technology, the state continues to grow as a significant contributor to India's development.",
      "cards": [

        "Birthplace of Kuchipudi: The classical dance form Kuchipudi originated from a village of the same name in Andhra Pradesh and is one of the eight major Indian classical dances.",

        "Longest Coastline in South India: Andhra Pradesh has the longest coastline (over 970 km) among all the southern states, with beautiful beaches like R.K. Beach in Visakhapatnam.",

        "Home to the Tirupati Temple: The world-famous Tirumala Venkateswara Temple in Tirupati is one of the richest and most visited religious places globally.",

        "Mango Lover’s Paradise: Andhra Pradesh is one of the largest producers of mangoes in India and is known for the delicious Banganapalli variety.",

       "Amaravati – A Planned Capital: Amaravati is being developed as a smart and green city, planned with international standards to become the new capital.",

        "Rice Bowl of India: Thanks to the fertile Krishna and Godavari river deltas, Andhra Pradesh is often called the Rice Bowl of India due to its high rice production. "  ],
      "quizLink": ""
    },
    "arunachalpradesh": {
      "title": "Arunachal Pradesh - GeoLearn",
      "videoUrl": "https://www.youtube.com/embed/eEwvYClFJk4?si=8Y3t8cWFpgjzzgCY",
      "info": "Arunachal Pradesh, often referred to as the Land of the Rising Sun, is the northeasternmost state of India, sharing its borders with Bhutan, China, and Myanmar. Known for its breathtaking landscapes, towering mountains, and dense forests, the state is a paradise for nature lovers and adventure seekers. It is home to over 26 major tribes, each with its own unique culture, language, and traditions, making Arunachal Pradesh one of the most culturally diverse regions in India. The state capital, Itanagar, is a gateway to stunning valleys and historical sites. Rich in biodiversity, the state also houses many rare species of flora and fauna. With its untouched natural beauty and vibrant tribal heritage, Arunachal Pradesh offers a truly unique experience of India’s northeastern charm.",
      "cards": [

       "First Indian State to See the Sunrise: Arunachal Pradesh earns the title Land of the Rising Sun because it's the first state in India to witness the sunrise every day.",

        "Home to Over 26 Tribes: The state is incredibly diverse, with more than 26 major tribes and over 100 sub-tribes, each with distinct languages, customs, and festivals.",

        "Tawang Monastery – The Largest in India: Arunachal Pradesh is home to Tawang Monastery, the largest Buddhist monastery in India and the second-largest in the world outside of Tibet.",

        "Zero (Ziro) Festival of Music: The Ziro Valley hosts an eco-friendly, indie music festival every year, attracting artists and fans from all over the world.",

        "Rare Orchids and Butterflies: The state is known as the Orchid State of India, housing over 600 species of orchids and a dazzling variety of butterflies.",

        "Mysterious Lake of Skeletons: At Roopkund Lake, also known as the Lake of Skeletons, hundreds of ancient human skeletons were discovered, sparking interest among historians and scientists worldwide. "],
      "quizLink": ""
    },
    "assam": {
      "title": "Assam - GeoLearn",
      "videoUrl": "https://www.youtube.com/embed/9oPgAHk8VaU?si=_6FLqvQhC4yRCYfE",
      "info": "Assam, located in the northeastern region of India, is a beautiful state known for its lush green landscapes, rolling hills, and rich biodiversity. It is bordered by Bhutan and Arunachal Pradesh to the north and shares international boundaries with Bangladesh. The mighty Brahmaputra River flows through the state, shaping its fertile plains and vibrant culture. Assam is renowned for its world-famous tea, with vast plantations that produce some of the finest blends globally. The state is also home to the one-horned rhinoceros, found in Kaziranga National Park, a UNESCO World Heritage Site. With its unique blend of tribal traditions, colorful festivals like Bihu, and warm hospitality, Assam stands as a cultural and ecological treasure of India.",
      "cards": [
      
        "World’s Largest Tea-Producing Region: Assam is one of the largest tea producers in the world. Its tea gardens stretch across the state, and Assam Tea is famous globally for its strong flavor.",

        "Home to the One-Horned Rhinoceros: Assam's Kaziranga National Park shelters the largest population of the endangered one-horned rhinoceros in the world.",

        "Majuli – The World’s Largest River Island: Majuli, located on the Brahmaputra River, holds the title of the largest river island in the world and is a cultural center for Assamese traditions.",

        "Unique Silk Production: Assam is the only place in the world that produces three types of indigenous silk — Muga (golden silk), Eri, and Pat — making it a silk lover’s paradise.",

        "Bihu – The Festival of Joy: Assam celebrates Bihu three times a year, marking different agricultural phases, with dance, music, and traditional feasts.",

        "Asia’s Oldest Oil Refinery: Digboi, a town in Assam, is home to Asia’s first oil refinery and one of the oldest operational refineries in the world." ],
      "quizLink": ""
    },
    "bihar": {
      "title": "Bihar - GeoLearn",
      "videoUrl": "https://www.youtube.com/embed/vGYVvPbHDuY?si=ACupr7Gk0yXq3MM9",
      "info": "Bihar, located in eastern India, is a state rich in history, culture, and spiritual heritage. It is known as the birthplace of ancient civilizations and religions like Buddhism and Jainism. The city of Bodh Gaya, where Gautama Buddha attained enlightenment under the Bodhi tree, is one of the most important pilgrimage sites in the world. Bihar has been home to powerful empires like the Mauryas and Guptas, and it was a major center of learning with institutions like Nalanda University. Today, the state is rapidly developing while preserving its traditional values and vibrant festivals. With the Ganges River flowing through it, Bihar boasts fertile lands and a deep connection to India's cultural roots.",
      "cards": [

        "Birthplace of Buddhism and Jainism: Bihar is where Gautama Buddha attained enlightenment in Bodh Gaya and where Lord Mahavira, the 24th Tirthankara of Jainism, was born.",

        "Nalanda – An Ancient University: Nalanda University, established in the 5th century CE, was one of the world’s first residential universities and attracted scholars from as far as China and Greece.",

        "Chhath Puja Originated Here: The grand festival of Chhath Puja, dedicated to the Sun God, is believed to have originated in Bihar and is celebrated with great devotion and rituals.",

        "Home to the Longest River Bridge in India: The Bhupen Hazarika Setu (also known as the Digha–Sonpur Bridge or JP Setu) is one of India’s longest river bridges, spanning the mighty Ganges.",

        "Ancient Capital of Mighty Empires: The ancient city of Pataliputra (modern-day Patna) was the capital of powerful empires like the Maurya and Gupta dynasties.",

        "Litti Chokha – A Famous Delicacy: Bihar’s traditional dish, Litti Chokha, is loved not only in the state but across India for its unique flavor and rustic appeal." 
      ],
      "quizLink": ""
    },
    "chhattisgarh": {
      "title": "Chhattisgarh - GeoLearn",
      "videoUrl": "https://www.youtube.com/embed/ccEzYmumre8?si=IeI_wWWV99x_pvfp",
      "info": "Chhattisgarh, located in central India, is a state known for its rich tribal culture, natural beauty, and mineral wealth. Carved out of Madhya Pradesh in the year 2000, it is one of India’s youngest states. The capital city, Raipur, is a fast-growing urban hub, while the state itself is largely covered in forests and dotted with scenic waterfalls, caves, and wildlife sanctuaries. Chhattisgarh is home to a significant tribal population that preserves unique traditions, dances, and festivals. It is also a major contributor to India's power and steel production due to its abundant reserves of coal and iron ore. With its blend of cultural richness and natural wonders, Chhattisgarh offers a unique glimpse into India’s diverse heartland.",
      "cards": [
       "India's Rice Bowl: Chhattisgarh is often called the Rice Bowl of India because of its wide variety of rice grown in the state—over 20,000 varieties!",

       "Home to Tribal Richness: Around 30% of the state’s population is tribal, making it one of the most culturally rich regions with unique art, music, and dance forms like Panthi and Raut Nacha.",

       "Chitrakote – The Niagara of India: Chitrakote Waterfall, located near Jagdalpur, is the widest waterfall in India and is often called the Niagara Falls of India.",

       "Cave with Prehistoric Art: The Singhanpur Caves in Chhattisgarh have ancient rock paintings believed to be over 10,000 years old, showing signs of early human life.",

       "Mysterious Bhoot Bangla: In Raipur, there’s an old British-era bungalow known as Bhoot Bangla, which is famous for spooky stories and local legends.",

       "Diverse Wildlife: The state is home to several national parks and sanctuaries like Kanger Valley and Indravati National Park, where rare species like the wild buffalo and hill myna can be found."
      ],
      "quizLink": ""
    },                                 
    "goa": {
      "title": "Goa - GeoLearn",
      "videoUrl": "https://www.youtube.com/embed/whZensVsZRU?si=YjspXy5UM__qsN3h",
      "info": "Goa, a small coastal state on the western coast of India, is known for its picturesque beaches, vibrant culture, and rich history. Its beautiful landscapes, sandy shores, and crystal-clear waters attract tourists from all over the world. Goa's colonial past is evident in its stunning Portuguese-influenced architecture, with churches, forts, and quaint villages. Alongside its natural beauty, Goa is famous for its lively nightlife, delicious seafood, and numerous festivals. The state offers a unique blend of Indian and European cultures, making it a must-visit destination for those seeking relaxation, adventure, and cultural exploration.",
      "cards": [
        "Goa was a Portuguese colony for over 450 years, and this influence is still visible in its churches, architecture, and cuisine.",
       "Despite being the smallest state in India, Goa boasts the highest per capita income in the country.",
       "Goa is famous for its cashew orchards and the locally produced alcoholic drink Feni, made from cashews or coconut sap.",
       "Goa has two capitals: Panaji (the administrative capital) and Vasco da Gama (the commercial capital).",
       "Goa's coastal waters are home to a wide variety of marine life, including dolphins, making it a popular spot for aquatic tourism.",
      "The Basilica of Bom Jesus, a UNESCO World Heritage site, is famous for housing the remains of St. Francis Xavier, a prominent missionary."
      ],

      "quizLink": ""
    },
    "gujarat": {
      "title": "Gujarat - GeoLearn",
      "videoUrl": "https://www.youtube.com/embed/fr5GBKnlABY?si=4gOihkwRAV9qOJyG",
      "info": "Gujarat, located on the western coast of India, is known for its diverse culture, rich history, and major economic contributions. The state has a deep-rooted legacy, from being the birthplace of Mahatma Gandhi to its significant role in India’s independence struggle. Gujarat is famous for its vibrant festivals like Navratri and the grand Rann Utsav in the Rann of Kutch. Its diverse landscapes range from arid deserts to coastal plains, making it one of the most unique states in India. With its industrial prowess, including sectors like textiles, diamond processing, and petrochemicals, Gujarat continues to be a major economic engine for the country.",
      "cards": [
       "Gujarat was the birthplace of Mahatma Gandhi, the father of the nation, and continues to celebrate his legacy through numerous monuments and memorials.",
        "The state is home to the Rann of Kutch, known for its white salt desert, which hosts the famous Rann Utsav, a cultural festival celebrating local traditions and art.",
       "Gujarat has the longest coastline of any Indian state, stretching over 1,600 km, and offers beautiful beaches and ports along the Arabian Sea.",
       "The Gir National Park in Gujarat is the only place in the world where Asiatic lions can be found in the wild.",
       "Gujarat is known for its diverse and colorful festivals, including Navratri, which is celebrated with grand dances and processions throughout the state.",
       "The state is famous for its traditional handicrafts like Patola silk, Bandhani textiles, and mirror work, showcasing Gujarat's rich craftsmanship."
      ],

      "quizLink": ""
    },
    "haryana": {
      "title": "Haryana - GeoLearn",
      "videoUrl": "https://www.youtube.com/embed/FvSa_3crRnE?si=q65BEDYccqukXanc",
      "info": "Haryana, a northern state in India, is known for its thriving agriculture, impressive sports achievements, and proximity to the national capital, Delhi. The state plays a vital role in India’s food production, with vast fields of wheat, rice, and other crops. Haryana has earned a reputation for producing some of India’s best wrestlers and athletes, contributing significantly to the country’s sports success. The state is also home to numerous historical and cultural landmarks, making it a blend of tradition and modernity. Its strategic location near Delhi further enhances its economic growth and development.",
      "cards": [
        "Haryana has produced many prominent wrestlers and athletes in India, contributing significantly to the country’s success in international sports.",
        "The state is known for its vast fields of wheat and rice, making it one of India’s leading agricultural producers.",
        "Sultanpur Bird Sanctuary in Haryana is home to many migratory birds, making it a popular destination for birdwatching enthusiasts.",
        "Haryana is famous for its rich cultural heritage, including the *Phag* dance and *Khaps*, traditional local gatherings that influence social life.",
       "The state has a thriving industrial sector, with industries such as textiles, automobiles, and electronics contributing to its economy.",
       "Haryana is home to the historically significant city of Kurukshetra, the site of the famous battle of the Mahabharata."
      ],

      "quizLink": ""
    },
    "himachalpradesh": {
      "title": "Himachal Pradesh - GeoLearn",
      "videoUrl": "https://www.youtube.com/embed/HR5zBd7_gsc?si=U8fwCMAHoX0u3D-s",
      "info": "Himachal Pradesh, located in the Himalayan region, is known for its breathtaking scenic landscapes, charming hill stations, and outdoor adventure opportunities. The state is a popular destination for trekkers, nature lovers, and those seeking tranquility amidst majestic mountains. From the bustling town of Shimla to the serene valleys of Kullu and Manali, Himachal Pradesh offers a perfect escape. The state is also rich in culture and tradition, with various temples, monasteries, and festivals that reflect its deep spiritual roots. Whether it's the snow-capped peaks or the lush green valleys, Himachal Pradesh captivates visitors with its natural beauty and serene ambiance.",
      "cards": [
       "Shimla, the capital of Himachal Pradesh, was once the summer capital of British India, and its colonial architecture still attracts visitors.",
       "The Great Himalayan National Park, a UNESCO World Heritage site, is known for its rich biodiversity and stunning mountain landscapes.",
       "Himachal Pradesh is known for its apple orchards, particularly in Kullu and Manali, which produce some of the best apples in the country.",
       "The state is home to the famous Kullu Dussehra, a vibrant festival that showcases local traditions and attracts tourists every year.",
       "Himachal Pradesh is a haven for adventure enthusiasts, offering activities like trekking, skiing, paragliding, and river rafting.",
       "The state has a rich cultural heritage, with ancient temples and monasteries like Hidimba Temple in Manali and *Tashijong Monastery* in Palampur."],

      "quizLink": ""
    },
    "jharkhand": {
      "title": "Jharkhand - GeoLearn",
      "videoUrl": "https://www.youtube.com/embed/02JHAoelt9I?si=1T0vvJ_NJWY-39ak",
      "info": "Jharkhand, located in eastern India, is known for its rich deposits of minerals, dense forests, and diverse wildlife. The state is one of the leading producers of coal, iron ore, and other minerals in India, contributing significantly to the country’s economy. Jharkhand’s natural beauty, with its picturesque hills, waterfalls, and wildlife sanctuaries, makes it a hidden gem for nature lovers. The state is also culturally vibrant, with a large tribal population that preserves unique traditions, languages, and festivals. Jharkhand offers a blend of nature, culture, and spirituality, with various sacred sites and adventure tourism opportunities.",
      "cards": [
       "Jharkhand is home to the famous Parasnath Hill, a pilgrimage site for Jainism, attracting thousands of devotees each year.",
       "The state has a large tribal population, with unique cultures and traditions, including vibrant festivals like Sarhul and Makar Sankranti.",
       "The Betla National Park is a major wildlife sanctuary in Jharkhand, known for its rich biodiversity and the presence of tigers, elephants, and leopards.",
       "Jharkhand has a number of stunning waterfalls, including Jonha, Hundru, and Dassam, making it a perfect destination for nature lovers and trekkers.",
       "The state is a major hub for coal mining and heavy industries, which play a key role in India’s industrial development.",
       "Jharkhand is also known for its folk music and dance forms, with the Chhau Dance and Jhumar being some of the popular traditional performances."],

      "quizLink": ""
    },
    "karnataka": {
     "title": "Karnataka - GeoLearn",
     "videoUrl": "https://www.youtube.com/embed/tlRxO_i0M38?si=xDfgUCRg9wuprowa",
     "info": "Karnataka, located in the southwestern part of India, is known for its rich historical heritage, vibrant culture, and thriving IT industry. The state is home to numerous architectural wonders, ancient temples, and lush landscapes. Its capital city, Bangalore, is often referred to as the 'Silicon Valley of India' due to its booming tech industry. Karnataka’s history is deeply intertwined with the mighty Vijayanagara Empire, whose ruins at Hampi are now a UNESCO World Heritage site. Beyond its urban appeal, Karnataka is also famous for its scenic coffee plantations, particularly in the picturesque region of Coorg, attracting both nature lovers and coffee enthusiasts.",
     "cards": [
       "Bangalore, the capital city, is known as the 'Silicon Valley of India' due to its dominance in the technology and startup sectors.",
       "Hampi, a UNESCO World Heritage site, was once the capital of the Vijayanagara Empire and is known for its stunning ruins and historical significance.",
       "Karnataka is known for its coffee plantations in Coorg, producing some of the finest coffee beans in India.",
       "The state boasts beautiful beaches along the Arabian Sea, including Gokarna and Malpe, attracting both tourists and pilgrims.",
       "Karnataka is famous for its rich classical music tradition, particularly Carnatic music, which is deeply rooted in its culture.",
       "The state is home to Jog Falls, one of the tallest waterfalls in India, located in the Western Ghats."],

      "quizLink": ""
    },
    "kerala": {
     "title": "Kerala - GeoLearn",
     "videoUrl": "https://www.youtube.com/embed/cthynGneIFQ?si=4Si_4DTO7l0CnugB",
     "info": "Kerala, known for its serene backwaters, palm-lined beaches, and rich cultural heritage, is one of the most popular tourist destinations in India. Often referred to as 'God's Own Country', Kerala’s lush landscapes, diverse wildlife, and pristine coastline attract visitors from across the world. The state is famous for its unique houseboat cruises along the backwaters in places like Alleppey and Kumarakom, offering a tranquil experience. Kerala is also the birthplace of Ayurveda, the ancient system of holistic medicine, which continues to attract people seeking wellness and healing. With its rich traditions in dance, music, and festivals, Kerala offers a truly immersive cultural experience.",
     "cards": [
       "Kerala is often called 'God's Own Country' due to its stunning natural beauty, including backwaters, beaches, and hills.",
       "The backwaters of Kerala, including Alleppey and Kumarakom, are famous for houseboat rides, offering a unique way to explore the state's scenic beauty.",
       "Kerala is the birthplace of Ayurveda, the ancient Indian system of medicine, which continues to be practiced in its traditional form across the state.",
        "The state is famous for its vibrant festivals, including Onam, which showcases traditional dance, music, and elaborate feasts.",
       "Kerala is home to the unique Kathakali dance form, known for its elaborate costumes and facial expressions telling mythological stories.",
       "The state boasts some of the best beaches in India, like Varkala and Kovalam, which are perfect for relaxation and water sports."],

      "quizLink": ""
    },
    "madhyapradesh": {
      "title": "Madhya Pradesh - GeoLearn",
      "videoUrl": "https://www.youtube.com/embed/gSpb5zI4BCs?si=hkREZdQFFr__YD2o",
      "info": "Madhya Pradesh, often referred to as the heart of India, is rich in history, culture, and natural beauty. The state is home to some of India’s most famous historical monuments, wildlife sanctuaries, and religious sites. From the ancient temples of Khajuraho to the bustling streets of Ujjain, Madhya Pradesh offers a blend of heritage and spirituality. The state is also famous for its rich wildlife, including the iconic Bengal tigers in Kanha National Park. Whether it’s exploring the architectural marvels, experiencing local traditions, or immersing oneself in nature, Madhya Pradesh offers something for every traveler.",
      "cards": [
       "Khajuraho, a UNESCO World Heritage site, is famous for its ancient temples adorned with intricate erotic sculptures that showcase the artistic brilliance of the Chandela dynasty.",
       "The Kanha National Park in Madhya Pradesh is one of the largest national parks in India and is known for its rich biodiversity, including tigers, leopards, and various species of birds.",
       "The state is home to the ancient city of Ujjain, an important Hindu pilgrimage site known for the Mahakaleshwar Jyotirlinga temple and its Kumbh Mela celebrations.",
       "Madhya Pradesh boasts the Sanchi Stupa, a UNESCO World Heritage site, which is one of the oldest and most significant Buddhist monuments in India.",
       "The state is known for its beautiful wildlife sanctuaries like Bandhavgarh and Pench, where visitors can spot tigers and other wildlife in their natural habitat.",
       "Madhya Pradesh is famous for its traditional dance forms, like Gond and Kalbelia, which reflect the rich cultural heritage of the tribal communities in the region."],

      "quizLink": ""
    },
    "maharashtra": {
      "title": "Maharashtra - GeoLearn",
      "videoUrl": "https://www.youtube.com/embed/RSbntXUoIEg?si=0IzNSNYeR0epXZ1N",
      "info": "Maharashtra, located in western India, is a vibrant state known for its diverse landscapes, cultural richness, and economic strength. It is home to Mumbai, the bustling capital city and financial hub of the country, where tradition and modernity blend seamlessly. Maharashtra is renowned for its historic landmarks, like the Ajanta and Ellora caves, which reflect the artistic brilliance of ancient India. The state’s food, festivals, and performing arts form an integral part of its identity, making it a cultural powerhouse. From hill stations to beaches, and temples to film studios, Maharashtra offers a mix of experiences for every traveler.",
      "cards": [
         "Mumbai, the capital of Maharashtra, is the entertainment capital of India and home to Bollywood, attracting actors, filmmakers, and dreamers from across the country.",
         "Maharashtra is home to Ajanta and Ellora caves, famous for their ancient rock-cut temples and monasteries that showcase exquisite sculptures and murals.",
         "The state is known for its delicious vada pav, pav bhaji, and puran poli, which are popular street foods loved by locals and tourists alike.",
         "Maharashtra hosts the vibrant Ganesh Chaturthi festival, celebrated with great enthusiasm, music, and elaborate processions.",
         "The Western Ghats in Maharashtra are a UNESCO World Heritage site, known for their rich biodiversity and scenic beauty, especially during the monsoon season.",
         "The city of Pune in Maharashtra is a major educational and cultural center, often referred to as the Oxford of the East."],

      "quizLink": ""
    },
    "manipur": {
      "title": "Manipur - GeoLearn",
      "videoUrl": "https://www.youtube.com/embed/2jkQpRCxDQA?si=EYfGiHTgcqOrrn7D",
      "info": "Manipur, located in the northeastern region of India, is a state blessed with natural charm, cultural richness, and deep-rooted traditions. Known as the 'Jewel of India', Manipur boasts picturesque landscapes, serene lakes, and lush green hills. The state is celebrated for its classical dance form, Manipuri, which is renowned for its graceful movements and spiritual storytelling. Manipur’s cultural diversity is reflected in its festivals, handloom artistry, and indigenous sports. With its unique floating islands on Loktak Lake and warm hospitality, Manipur offers a distinctive experience that captures both the heart and imagination.",
      "cards": [
        "Manipur is known for its classical dance form, Manipuri, which is a UNESCO intangible cultural heritage and is deeply tied to the state’s spiritual and mythological traditions.",
       "The Loktak Lake, with its floating phumdis, is the largest freshwater lake in northeastern India and supports the only floating national park in the world, Keibul Lamjao.",
       "Manipur is famous for its handloom products, especially its intricately woven shawls and traditional textiles that reflect the rich tribal culture.",
       "The state has a rich martial arts tradition, including 'Thang-Ta', a traditional Manipuri sword fighting art form.",
       "Manipur was one of the first places in India where the game of polo was played, and it is considered the birthplace of modern polo.",
       "The Sangai Festival, named after the endangered Sangai deer found only in Manipur, showcases the state’s art, culture, dance, and adventure sports."],

      "quizLink": ""
    },
    "meghalaya": {
      "title": "Meghalaya - GeoLearn",
      "videoUrl": "https://www.youtube.com/embed/b8gH7vam3uk?si=gpeTvly0DR-H6JJU",
      "info": "Meghalaya, meaning 'Abode of Clouds', is a breathtakingly beautiful state nestled in the northeastern part of India. Famous for its mist-covered hills, abundant rainfall, and serene landscapes, Meghalaya offers a unique blend of nature and tradition. The state is home to fascinating living root bridges, crafted by the indigenous Khasi and Jaintia tribes by guiding the roots of rubber trees across streams. Meghalaya’s culture is rich in music, dance, and folklore, and the people are known for their hospitality and vibrant festivals. With stunning caves, crystal-clear rivers, and lush greenery, Meghalaya is a paradise for nature lovers and adventurers alike.",
      "cards": [
       "Meghalaya is known as the 'Abode of Clouds' due to its consistently high rainfall and foggy landscapes that create a dreamy atmosphere.",
       "The living root bridges in Meghalaya are unique natural wonders, made by guiding the roots of rubber trees to form sturdy, walkable structures over streams and rivers.",
       "Cherrapunji in Meghalaya was once considered the wettest place on Earth and is still one of the rainiest regions globally, attracting weather enthusiasts and travelers.",
       "Mawsynram, a village in Meghalaya, currently holds the title of the wettest place on Earth due to its extraordinary annual rainfall.",
       "Meghalaya is home to some of the longest and deepest caves in South Asia, such as the Siju and Mawsmai caves, which are popular for exploration and tourism.",
       "The traditional attire, music, and dances of tribes like the Khasi, Garo, and Jaintia add vibrant cultural charm to the state's scenic beauty."],

      "quizLink": ""
    },



    "mizoram": {
        "title": "Mizoram - GeoLearn",
        "videoUrl": "https://www.youtube.com/embed/NsmjXE92y38?si=2ALrotm_mtrxKgHU",
        "info": "Mizoram, a picturesque state in the northeastern part of India, is celebrated for its rolling hills, vibrant tribal culture, and natural beauty. The name 'Mizoram' translates to 'land of the hill people', and the state is predominantly inhabited by the Mizo community. Known for their warm hospitality, the Mizos have a rich tradition of music, dance, and colorful festivals that reflect their deep-rooted cultural values. Mizoram also boasts impressive biodiversity, with dense bamboo forests, rare orchids, and abundant wildlife. Its serene landscapes and peaceful lifestyle make it one of the most charming and least explored states in India.",
        "cards": [
         "Mizoram is home to the Mizo people, known for their love of music, energetic dances like Cheraw, and vibrant festivals such as Chapchar Kut.",
         "The state is famous for its lush green hills, deep valleys, and expansive bamboo forests that cover a major part of its terrain.",
         "Mizoram has one of the highest literacy rates in India, showcasing the state's strong emphasis on education and development.",
         "The traditional bamboo dance, Cheraw, involves dancers rhythmically stepping between moving bamboo sticks and is one of Mizoram’s cultural highlights.",
         "Aizawl, the capital city, is nestled on a ridge at nearly 3,500 feet and offers stunning views of the surrounding hills and valleys.",
         "Mizoram shares international borders with Bangladesh and Myanmar, making it a culturally diverse region with unique influences."],

        "quizLink": ""
    },
    "nagaland": {
        "title": "Nagaland - GeoLearn",
        "videoUrl": "https://www.youtube.com/embed/kDPN7fkfzpk?si=J6esrSz13jtz48iE",
        "info": "Nagaland, nestled in the northeastern region of India, is a land of breathtaking landscapes, vibrant traditions, and deeply rooted tribal heritage. With its rolling hills and picturesque valleys, the state is home to numerous indigenous tribes, each with distinct customs, attire, and languages. Nagaland is best known for its energetic festivals, especially the iconic Hornbill Festival, which brings together all tribes to celebrate their culture through music, dance, and traditional crafts. The people of Nagaland are known for their hospitality, resilience, and strong community bonds. With its unspoiled nature, rich biodiversity, and cultural richness, Nagaland offers a unique and immersive experience.",
        "cards": [
         "Nagaland is known for the Hornbill Festival, an annual cultural extravaganza held in December that showcases tribal traditions, crafts, music, and dance in a grand celebration.",
         "The state is home to sixteen major tribes, each with its own unique customs, dialects, attire, and traditional practices that highlight the incredible diversity of the region.",
         "Nagaland is rich in flora and fauna, with several rare species of orchids, birds, and animals found only in this part of India, making it a biodiversity hotspot.",
         "Kohima, the capital of Nagaland, was a significant site during World War II and is home to the famous Kohima War Cemetery dedicated to Allied soldiers.",
         "Traditional Naga cuisine features smoked meats, bamboo shoot dishes, and spicy chutneys, offering bold and distinctive flavors unique to the region.",
         "Nagaland's hilly terrain and dense forests make it an excellent destination for trekking, birdwatching, and eco-tourism adventures."],

        "quizLink": ""
    },
    "odisha": {
        "title": "Odisha - GeoLearn",
        "videoUrl": "https://www.youtube.com/embed/CafvsmmWpi8?si=hSR0Ej3ZXjmLN7kg",
        "info": "Odisha, a coastal state in eastern India, is known for its deep historical roots, architectural marvels, and cultural richness. The state is adorned with ancient temples, serene beaches, and vibrant festivals that reflect its spiritual and artistic heritage. Odisha's cultural legacy is strongly represented through its classical dance form, Odissi, and various traditional art forms like Pattachitra painting and applique work. With a coastline stretching along the Bay of Bengal, Odisha also offers natural beauty through its forests, waterfalls, and wildlife sanctuaries. It’s a land where devotion, heritage, and nature come together in perfect harmony.",
        "cards": [
         "Odisha is home to the famous Jagannath Temple in Puri, which draws millions of devotees each year, especially during the grand Rath Yatra festival.",
         "The state has a rich tradition of classical and folk dance, with Odissi being one of the eight recognized classical dance forms of India.",
         "Konark Sun Temple, shaped like a colossal chariot and dedicated to the Sun God, is a UNESCO World Heritage site and a masterpiece of ancient architecture.",
         "Odisha’s Chilika Lake is Asia’s largest brackish water lagoon and a paradise for migratory birds, attracting birdwatchers from around the world.",
         "The tribal communities of Odisha contribute significantly to its culture, with unique traditions, festivals, and handicrafts that enrich the state’s identity.",
         "Odisha celebrates many colorful festivals like Durga Puja, Raja Parba, and Makar Sankranti, which highlight its cultural diversity and local traditions."],

        "quizLink": ""
    },
    "punjab": {
        "title": "Punjab - GeoLearn",
        "videoUrl": "https://www.youtube.com/embed/HDbYm56G8PM?si=gpogtxv9NkGDlPqC",
        "info": "Punjab, located in the northwestern part of India, is a land of fertile fields, spirited people, and deep-rooted traditions. Known as the 'Land of Five Rivers', it is one of the most agriculturally productive states in the country and plays a vital role in India’s food grain production. Punjab is not only famous for its green revolution success but also for its vibrant festivals, energetic Bhangra dance, and soulful music. The state’s history is rich with tales of bravery and devotion, seen in its many Gurudwaras and historic sites. Punjab's lively culture, warm hospitality, and flavorful cuisine make it a heartland of Indian heritage.",
        "cards": [
         "Punjab is the land of the Golden Temple in Amritsar, which is the holiest shrine for Sikhs and a symbol of peace and unity.",
         "The state is renowned for its rich and hearty cuisine, with popular dishes like butter chicken, sarson da saag, and makki di roti enjoyed across the country.",
         "Punjab is called the breadbasket of India because it contributes a large share of wheat and rice to the national food supply.",
         "The state’s traditional folk dances, such as Bhangra and Giddha, are energetic, colorful, and a major part of celebrations and festivals.",
          "Punjab played a crucial role in India’s freedom movement, producing many revolutionaries like Bhagat Singh who inspired the nation.",
         "The Wagah Border ceremony near Amritsar is a daily military practice that attracts tourists with its patriotic fervor and dramatic display."],

        "quizLink": ""
    },
    "rajasthan": {
        "title": "Rajasthan - GeoLearn",
       "videoUrl": "https://www.youtube.com/embed/NABIqPoYIb8?si=fm7IDBWXoSYCOavB",
       "info": "Rajasthan, the largest state in India by area, is a land of golden sands, vibrant culture, and regal heritage. Known for its vast deserts, magnificent forts, and royal palaces, it offers a glimpse into the opulence of India’s past. The state's culture is a blend of folk music, colorful attire, and grand festivals like Pushkar Fair and Desert Festival. From camel rides in the Thar Desert to the intricate architecture of cities like Jaipur and Jodhpur, Rajasthan captivates visitors with its charm. The hospitality of its people and the tales of valiant kings and queens make it a timeless destination.",
        "cards": [
          "Rajasthan is home to the Thar Desert, the largest desert in India, known for its sand dunes and camel safaris.",
         "The state is famous for its majestic palaces and forts, such as the Amer Fort in Jaipur and the City Palace in Udaipur, reflecting its royal legacy.",
         "Jaipur, the capital city, is known as the 'Pink City' due to the pink-hued buildings in its old town, designed to welcome royal guests.",
         "Rajasthan hosts the colorful Pushkar Camel Fair, a unique festival where thousands of camels are traded, decorated, and paraded.",
         "The Mehrangarh Fort in Jodhpur, one of the largest forts in India, offers panoramic views and a deep dive into Rajput history.",
         "Rajasthani cuisine, including dishes like dal baati churma and gatte ki sabzi, showcases bold flavors and traditional cooking methods."],
        "quizLink": ""
    },
    "sikkim": {
        "title": "Sikkim - GeoLearn",
        "videoUrl": "https://www.youtube.com/embed/QvmCrInW5FQ?si=YP43MsJLJLnkd_Sg",
        "info": "Sikkim, nestled in the Himalayas, is one of India’s most serene and smallest states, known for its pristine natural beauty and peaceful ambiance. With snow-capped mountains, alpine meadows, and lush valleys, it offers a haven for nature lovers and trekkers alike. Sikkim's culture is a harmonious blend of Hindu and Buddhist traditions, visible in its colorful festivals and ancient monasteries like Rumtek and Pemayangtse. It is also a leading example of sustainable development and environmental conservation. The state’s commitment to organic farming and eco-tourism has made it a model for green initiatives in India.",
        "cards": [
          "Sikkim is home to Kangchenjunga, the third-highest mountain in the world and a sacred peak for the locals.",
         "The state has a unique blend of Hindu and Buddhist cultures, reflected in its vibrant festivals, monasteries, and temples.",
         "Sikkim is the first fully organic state in India, with all its farmland certified organic and free from chemical fertilizers and pesticides.",
         "The Yumthang Valley, also known as the Valley of Flowers, bursts into color during spring with a variety of blooming alpine flowers.",
          "Sikkim is one of the few Indian states that has banned plastic and promotes eco-friendly practices at every level.",
         "The Nathula Pass in Sikkim is a historic trade route that connects India to Tibet and is a popular tourist destination today."],

        "quizLink": ""
    },
    "tamilNadu": {
       "title": "Tamil Nadu - GeoLearn",
       "videoUrl": "https://www.youtube.com/embed/4SGcXeFO1OM?si=reRswbT6sHWEAQqo",
       "info": "Tamil Nadu, located in the southern tip of India, is a land steeped in rich history, culture, and artistic heritage. It is famous for its magnificent Dravidian-style temples, vibrant festivals, classical arts, and delicious cuisine. The state is a major hub of literature, film, and music, with a strong tradition of preserving its language and customs. From the beaches of Chennai to the hill stations of Ooty and Kodaikanal, Tamil Nadu offers a diverse range of experiences. Its contributions to science, technology, and industrial growth make it one of the most progressive states in India.",
       "cards": [
         "Chennai, the capital of Tamil Nadu, is known as the 'Detroit of India' due to its booming automobile industry and manufacturing plants.",
         "The state is famous for its ancient and intricately carved temples, such as the Meenakshi Temple in Madurai and the Brihadeeswarar Temple in Thanjavur.",
         "Tamil Nadu is a major center for Bharatanatyam, one of the oldest classical dance forms of India, with roots tracing back to temple performances.",
         "The Marina Beach in Chennai is one of the longest urban beaches in the world and a popular destination for locals and tourists alike.",
         "Tamil Nadu is home to many UNESCO World Heritage sites, including the Group of Monuments at Mahabalipuram, showcasing stunning stone carvings.",
         "The Pongal festival, celebrated in January, is one of the most important harvest festivals in Tamil Nadu, marking a time of gratitude and cultural pride."],

        "quizLink": ""
    },
    "telangana": {
       "title": "Telangana - GeoLearn",
       "videoUrl": "https://www.youtube.com/embed/_bdWtap-H_g?si=O0tppxtcNux6TifD",
       "info": "Telangana, a newly formed state in southern India, boasts a rich history, a thriving culture, and a rapidly growing IT sector. Hyderabad, its capital, is a blend of old-world charm and modern innovation, famous for its historical monuments, tech parks, and mouthwatering cuisine. The state's heritage is reflected in its impressive temples, forts, and rich traditions. With landmarks like the Charminar, Telangana offers visitors a unique experience combining history with contemporary progress. The state is also known for its vibrant festivals and dedication to preserving its cultural identity.",
       "cards": [
         "Hyderabad, the capital of Telangana, is known for its iconic Charminar, a 16th-century mosque with grand arches and minarets.",
         "The state is famous for its Hyderabadi biryani, a delicious and aromatic rice dish that traces its origins to the Mughal era.",
         "Telangana is home to several ancient temples and forts, such as the historic Warangal Fort, which dates back to the 13th century.",
         "The state is known for its traditional Bathukamma festival, celebrated by women with colorful flowers and dances.",
         "Hyderabad’s Hussain Sagar Lake, which connects the twin cities of Hyderabad and Secunderabad, is a popular spot for boating and sightseeing.",
         "Telangana has a thriving arts scene, with local crafts like Pochampally ikat weaving and Bidri metalwork being internationally recognized."],
        "quizLink": ""
    },
    "tripura": {
       "title": "Tripura - GeoLearn",
       "videoUrl": "https://www.youtube.com/embed/tIx9cGSowOc?si=l5HAVMRgBxILN9WF",
       "info": "Tripura, nestled in the northeastern part of India, is a state known for its royal heritage, cultural diversity, and breathtaking landscapes. The state's history is reflected in its ancient temples, palaces, and rich traditions, while its scenic beauty attracts nature lovers and travelers alike. With a blend of Hindu, Buddhist, and tribal influences, Tripura offers a unique cultural experience. From lush green hills to serene lakes, the state is a hidden gem in the northeastern region of India, known for its warmth and hospitality.",
      "cards": [
        "Tripura is home to the Tripura Sundari Temple, one of the 51 Shakti Peethas in India, attracting pilgrims from across the country.",
       "The state has a rich tradition of handlooms and handicrafts, with woven carpets and intricate bamboo products being popular across the globe.",
       "Tripura is known for its wildlife sanctuaries, such as the Sepahijala Wildlife Sanctuary, home to diverse flora and fauna, including migratory birds.",
       "The state is famous for its traditional festivals, including Kharchi Puja, which is celebrated with great zeal and cultural significance.",
       "Ujjayanta Palace, once the royal residence, is now a museum that showcases the rich history and culture of Tripura.",
       "Tripura shares borders with Bangladesh, making it a strategic region with diverse cultural exchanges and influences."],
        "quizLink": ""
    },

    "uttarakhand": {
    "title": "Uttarakhand - GeoLearn",
    "videoUrl": "https://www.youtube.com/embed/yqL6ss0uR5o?si=DEVVyk8eqfFElvAP",
    "info": "Uttarakhand, a picturesque state located in northern India, is renowned for its breathtaking mountains, lush valleys, and serene pilgrimage sites. Often referred to as the 'Land of Gods,' the state is a spiritual hub, attracting millions of pilgrims to its holy cities like Haridwar and Rishikesh. Uttarakhand also offers incredible opportunities for adventure enthusiasts, with its trekking routes, hill stations, and natural beauty. The state is home to a range of flora and fauna, including the famous Jim Corbett National Park, and is a favorite destination for nature lovers and spiritual seekers alike.",
    "cards": [
      "Uttarakhand is known for its two famous pilgrimage sites: Haridwar, where the Ganga Aarti is a significant spiritual event, and Rishikesh, known as the 'Yoga Capital of the World.'",
     "The state is home to several popular hill stations, including Nainital and Mussoorie, known for their serene landscapes and cool climate.",
     "Nanda Devi, located in Uttarakhand, is the second-highest mountain in India and a part of the Nanda Devi Biosphere Reserve.",
      "Uttarakhand is also known for the Rajaji National Park, which is a haven for wildlife, including tigers, elephants, and leopards.",
     "The state is home to the famous Valley of Flowers, a UNESCO World Heritage site, renowned for its stunning meadows of alpine flowers.",
     "Uttarakhand’s Kumbh Mela, held every 12 years in Haridwar, attracts millions of devotees who come to take a dip in the holy Ganges."],
    "quizLink": ""
    },


     "uttarpradesh": {
        "title": "Uttar Pradesh - GeoLearn",
        "videoUrl": "https://www.youtube.com/embed/pnTR2YTjztM?si=CWyfJJ8slRIFx7i2",
        "info": "Uttar Pradesh, located in the northern part of India, is one of the most populous and historically significant states in the country. Known for its religious landmarks, historical sites, and cultural heritage, Uttar Pradesh is home to iconic monuments like the Taj Mahal and the holy city of Varanasi. The state plays a central role in India's spiritual and cultural history, attracting millions of pilgrims and tourists every year. With its rich traditions and diverse heritage, Uttar Pradesh offers a unique glimpse into India's past and present.",
        "cards": [
          "Uttar Pradesh is home to the Taj Mahal, one of the Seven Wonders of the World, which is a symbol of love and an architectural marvel.",
         "The city of Varanasi, on the banks of the Ganges, is one of the oldest living cities in the world, known for its spiritual significance and ghats.",
         "The Kumbh Mela, held in Allahabad, is one of the largest religious gatherings in the world, where millions of devotees gather to take a dip in the holy Ganges.",
          "Agra Fort, a UNESCO World Heritage site, is a historic fort built by the Mughal emperors and is a prominent landmark in Agra.",
         "Uttar Pradesh is the birthplace of Lord Krishna, and the city of Mathura is a major pilgrimage site for Hindus.",
         "The state is known for its traditional crafts, including zari work, carpet weaving, and brassware."],

        "quizLink": ""
    },
    "westbengal": {
       "title": "West Bengal - GeoLearn",
       "videoUrl": "https://www.youtube.com/embed/33FA7zb2B-k?si=UjLJuBR04gXWzHSi",
       "info": "West Bengal, located in the eastern part of India, is known for its rich cultural heritage, intellectual legacy, and historical significance. The state is a melting pot of traditions, art, literature, and cuisine. Its capital, Kolkata, is famous for its colonial architecture, literary history, and festivals, making it a cultural hub. West Bengal is also home to diverse natural beauty, from the serene landscapes of Darjeeling to the unique mangrove forests of the Sundarbans.",
       "cards": [
         "Kolkata, the capital of West Bengal, is known as the 'City of Joy' for its vibrant culture, festivals, and the warmth of its people.",
         "West Bengal is the birthplace of many great poets and intellectuals, including Rabindranath Tagore, who won the Nobel Prize in Literature.",
         "The Sundarbans, the largest mangrove forest in the world, is located in West Bengal and is home to the famous Royal Bengal tiger.",
         "West Bengal is renowned for its delicious cuisine, including sweets like rasgulla and sandesh, which are popular across India.",
         "The state is famous for its traditional dance forms, such as Chau and Baul, which reflect the rich cultural diversity of the region.",
         "West Bengal is home to the iconic Howrah Bridge, a symbol of Kolkata and an architectural marvel."],

        "quizLink": ""
    },


    
      "andamanandnicobar": {
        "title": "Andaman and Nicobar Islands - GeoLearn",
        "videoUrl": "https://www.youtube.com/embed/AWreVddG7nc?si=vQED-WDZJW2xMXod",
        "info": "The Andaman and Nicobar Islands, located in the Bay of Bengal, are a group of picturesque islands known for their pristine beaches, coral reefs, and lush rainforests. This Union Territory is significant for its strategic location and biodiversity. Port Blair, the capital, houses the infamous Cellular Jail, a colonial-era prison that stands as a symbol of India's freedom struggle. The islands are also home to indigenous tribes and are famous for activities like scuba diving and snorkeling.",
        "cards": [
          "Cellular Jail – The Kala Pani: This historical colonial prison in Port Blair once held Indian freedom fighters in isolation.",
          "Diverse Marine Life: These islands are a hotspot for coral reefs and marine biodiversity, making them perfect for underwater adventures.",
          "Home to Indigenous Tribes: The islands are inhabited by indigenous tribes like the Sentinelese, Jarawas, and Nicobarese.",
          "Strategic Naval Importance: Due to its location, it plays a crucial role in India’s naval defense.",
          "Barren Island Volcano: India’s only active volcano is located on Barren Island here.",
          "Eco-Tourism Paradise: The islands promote sustainable and eco-friendly tourism practices."
        ],
        "quizLink": ""
      },

      "chandigarh": {
        "title": "Chandigarh - GeoLearn",
        "videoUrl": "https://www.youtube.com/embed/eME4-UB_JtM?si=-skM_RjsspxxV5m2",
        "info": "Chandigarh, the joint capital of Punjab and Haryana, is a Union Territory and a modern city known for its architecture and urban planning. Designed by the French architect Le Corbusier, it is considered one of the best-planned cities in India. It offers a unique blend of urban sophistication and green spaces.",
        "cards": [
          "Designed by Le Corbusier: Chandigarh is globally recognized for its architectural planning by the famous French architect.",
          "Rock Garden of Nek Chand: An artistic marvel made from industrial and domestic waste, this garden is a major tourist attraction.",
          "The City Beautiful: Known for its cleanliness, greenery, and orderly layout, it is often referred to as 'The City Beautiful'.",
          "High Quality of Life: Chandigarh often ranks high on human development and living standards in India.",
          "Capitol Complex: A UNESCO World Heritage Site featuring government buildings designed by Le Corbusier.",
          "Shared Capital: It serves as the capital of both Punjab and Haryana while being a Union Territory."
        ],
        "quizLink": ""
      },
      "delhi": {
        "title": "Delhi - GeoLearn",
        "videoUrl": "https://www.youtube.com/embed/Jlfgtb1_qlI?si=7cw8jT8Rnfpy3zwX",
        "info": "Delhi, officially the National Capital Territory (NCT) of Delhi, is a vibrant Union Territory that includes New Delhi, the capital of India. It is a political, cultural, and historical powerhouse, home to landmarks like the Red Fort, India Gate, and Qutub Minar. With a rich blend of ancient heritage and modern development, Delhi stands as a microcosm of the entire country.",
        "cards": [
          "Capital of India: New Delhi, a part of Delhi, is the official seat of all three branches of the Government of India.",
          "Historical Monuments: From the Red Fort to Humayun’s Tomb, Delhi is dotted with iconic structures.",
          "Cultural Melting Pot: Delhi is home to people from across India, offering diverse food, languages, and festivals.",
          "Metro Connectivity: Delhi Metro is one of the largest and most efficient metro networks in India.",
          "Hub of Politics: All major political activities and power centers operate from here.",
          "Education and Jobs: Delhi houses top institutions like AIIMS, DU, JNU and provides ample job opportunities."
        ],
        "quizLink": ""
      },
  
      
          "jammuandkashmir": {
            "title": "Jammu and Kashmir - GeoLearn",
            "videoUrl": "https://www.youtube.com/embed/8cEqudFGXnE?si=ORmDbj6iGeuCYg8B",
            "info": "Jammu and Kashmir, nestled in the Himalayas, is known for its breathtaking landscapes, rich cultural heritage, and religious significance. It became a Union Territory in 2019 after the abrogation of Article 370. While Jammu is famous for temples and winter capital status, Kashmir is known for its valleys, houseboats, and serene beauty.",
            "cards": [
              "Heaven on Earth: Kashmir is globally recognized for its scenic beauty, with snow-clad mountains and lakes.",
              "Dal Lake & Houseboats: A signature of Kashmir, offering unique stays on water.",
              "Vaishno Devi Temple: A major pilgrimage site attracting millions of devotees every year.",
              "Pashmina Wool: The world-famous Pashmina shawls are made here from fine goat hair.",
              "Two Capitals: Jammu and Srinagar function as the winter and summer capitals respectively.",
              "Revoked Special Status: J&K became a Union Territory in 2019 after Article 370 was repealed."
            ],
            "quizLink": ""
          },
          "ladakh": {
            "title": "Ladakh - GeoLearn",
            "videoUrl": "https://www.youtube.com/embed/1jYmbcPFkKU?si=ma3gB2eV0bXuIkyT",
            "info": "Ladakh, carved out of Jammu and Kashmir in 2019, is a Union Territory known for its stark mountains, Buddhist monasteries, and high-altitude desert beauty. It is sparsely populated but culturally rich, influenced heavily by Tibetan Buddhism. The capital Leh serves as the heart of Ladakh's tourism and culture.",
            "cards": [
              "Land of High Passes: Ladakh is renowned for its dramatic mountain passes like Khardung La.",
              "Buddhist Monasteries: Home to ancient monasteries like Hemis and Thiksey.",
              "Pangong Lake: A high-altitude lake that changes colors and attracts tourists worldwide.",
              "Cold Desert: It receives very little rainfall and has a unique desert-like terrain at high altitude.",
              "Festivals and Culture: Colorful festivals and masked dances reflect its vibrant Tibetan heritage.",
              "Union Territory Since 2019: Became a separate UT following the split from J&K."
            ],
            "quizLink": ""
          },
          "puducherry": {
            "title": "Puducherry - GeoLearn",
            "videoUrl": "https://www.youtube.com/embed/1ydi9AMvOGM?si=riC3SbM4HdRVDIah",
            "info": "Puducherry (formerly Pondicherry) is a Union Territory with a strong French colonial influence, reflected in its architecture, culture, and cuisine. It consists of four scattered districts: Puducherry, Karaikal, Mahe, and Yanam. Known for its beaches, spiritual centers, and calm atmosphere, Puducherry is a popular retreat destination.",
            "cards": [
              "French Connection: The French ruled Puducherry until 1954, and their legacy remains visible.",
              "Auroville: An experimental township promoting human unity and spiritual growth.",
              "Scattered Territories: Puducherry comprises non-contiguous regions across South India.",
              "Bilingual Culture: Tamil and French are widely spoken, and French-style street names are common.",
              "Colonial Architecture: Features old villas, churches, and tree-lined boulevards.",
              "Serene Beaches: Promenade Beach and Paradise Beach attract tourists all year round."
            ],
            "quizLink": ""
          },
          "lakshadweep": {
            "title": "Lakshadweep - GeoLearn",
            "videoUrl": "https://www.youtube.com/embed/KxLp9Y0McOc?si=6pMty76mR_8_HPih",
            "info": "Lakshadweep is India’s smallest Union Territory, comprising 36 islands in the Arabian Sea. Known for its lagoons, coral reefs, and marine biodiversity, it is a remote paradise. The UT is culturally linked to Kerala, with Malayalam and Mahl spoken by the locals. It plays a key role in India’s oceanic security and ecological conservation.",
            "cards": [
              "Coral Atolls: Lakshadweep is made up entirely of coral atolls and reefs.",
              "Smallest UT: It is the smallest in area and population among Indian Union Territories.",
              "Marine Biodiversity: Rich in marine life, it is ideal for scuba diving and snorkeling.",
              "No Alcohol Zone: Consumption of alcohol is restricted on most islands.",
              "Islamic Culture: The population is predominantly Muslim with strong cultural ties to Kerala.",
              "Kavaratti: The administrative capital and the most developed island."
            ],
            "quizLink": ""
          },
          "dadraandnagarhavelianddamananddiu": {
            "title": "Dadra and Nagar Haveli and Daman and Diu - GeoLearn",
            "videoUrl": "https://www.youtube.com/embed/_QN5VroObAc?si=UD0gtZfo4alO8i8B",
            "info": "This Union Territory is a merger of two former UTs—Dadra and Nagar Haveli and Daman and Diu—in 2020. It is located on the western coast of India and known for its scenic beaches, Portuguese heritage, and tribal culture. The administrative headquarters is in Daman.",
            "cards": [
              "Merged in 2020: Created by merging Dadra & Nagar Haveli with Daman & Diu for administrative efficiency.",
              "Portuguese Legacy: Strong influence of Portuguese rule, especially in Diu and Daman.",
              "Silvassa – Tribal Hub: Silvassa is known for its tribal heritage and lush greenery.",
              "Tourism Hotspots: Devka Beach, Jampore Beach, and St. Paul’s Church are popular sites.",
              "Industrial Development: The region has developed as an industrial hub due to tax benefits.",
              "Cultural Diversity: A blend of Gujarati, Maharashtrian, and tribal traditions."
            ],
            "quizLink": ""
          }
        }












    











      

















  
  