{
    "andamanandnicobar": {
      "title": "Andaman and Nicobar Islands - GeoLearn",
      "videoUrl": "https://www.youtube.com/embed/nm9ox3Hya9E",
      "info": "The Andaman and Nicobar Islands, located in the Bay of Bengal, are a group of picturesque islands known for their pristine beaches, coral reefs, and lush rainforests. This Union Territory is significant for its strategic location and biodiversity. Port Blair, the capital, houses the infamous Cellular Jail, a colonial-era prison that stands as a symbol of India's freedom struggle. The islands are also home to indigenous tribes and are famous for activities like scuba diving and snorkeling.",
      "cards": [
        "Cellular Jail – The Kala Pani: This historical colonial prison in Port Blair once held Indian freedom fighters in isolation.",
        "Diverse Marine Life: These islands are a hotspot for coral reefs and marine biodiversity, making them perfect for underwater adventures.",
        "Home to Indigenous Tribes: The islands are inhabited by indigenous tribes like the Sentinelese, Jarawas, and Nicobarese.",
        "Strategic Naval Importance: Due to its location, it plays a crucial role in India’s naval defense.",
        "Barren Island Volcano: India’s only active volcano is located on Barren Island here.",
        "Eco-Tourism Paradise: The islands promote sustainable and eco-friendly tourism practices."
      ],
      "quizLink": ""
    },
    "chandigarh": {
      "title": "Chandigarh - GeoLearn",
      "videoUrl": "https://www.youtube.com/embed/G0RZL2_F8bQ",
      "info": "Chandigarh, the joint capital of Punjab and Haryana, is a Union Territory and a modern city known for its architecture and urban planning. Designed by the French architect Le Corbusier, it is considered one of the best-planned cities in India. It offers a unique blend of urban sophistication and green spaces.",
      "cards": [
        "Designed by Le Corbusier: Chandigarh is globally recognized for its architectural planning by the famous French architect.",
        "Rock Garden of Nek Chand: An artistic marvel made from industrial and domestic waste, this garden is a major tourist attraction.",
        "The City Beautiful: Known for its cleanliness, greenery, and orderly layout, it is often referred to as 'The City Beautiful'.",
        "High Quality of Life: Chandigarh often ranks high on human development and living standards in India.",
        "Capitol Complex: A UNESCO World Heritage Site featuring government buildings designed by Le Corbusier.",
        "Shared Capital: It serves as the capital of both Punjab and Haryana while being a Union Territory."
      ],
      "quizLink": ""
    },
    "delhi": {
      "title": "Delhi - GeoLearn",
      "videoUrl": "https://www.youtube.com/embed/HU_ZV_MfN8s",
      "info": "Delhi, officially the National Capital Territory (NCT) of Delhi, is a vibrant Union Territory that includes New Delhi, the capital of India. It is a political, cultural, and historical powerhouse, home to landmarks like the Red Fort, India Gate, and Qutub Minar. With a rich blend of ancient heritage and modern development, Delhi stands as a microcosm of the entire country.",
      "cards": [
        "Capital of India: New Delhi, a part of Delhi, is the official seat of all three branches of the Government of India.",
        "Historical Monuments: From the Red Fort to Humayun’s Tomb, Delhi is dotted with iconic structures.",
        "Cultural Melting Pot: Delhi is home to people from across India, offering diverse food, languages, and festivals.",
        "Metro Connectivity: Delhi Metro is one of the largest and most efficient metro networks in India.",
        "Hub of Politics: All major political activities and power centers operate from here.",
        "Education and Jobs: Delhi houses top institutions like AIIMS, DU, JNU and provides ample job opportunities."
      ],
      "quizLink": ""
    },

    
        "jammuandkashmir": {
          "title": "Jammu and Kashmir - GeoLearn",
          "videoUrl": "https://www.youtube.com/embed/f_JvFsThWLQ",
          "info": "Jammu and Kashmir, nestled in the Himalayas, is known for its breathtaking landscapes, rich cultural heritage, and religious significance. It became a Union Territory in 2019 after the abrogation of Article 370. While Jammu is famous for temples and winter capital status, Kashmir is known for its valleys, houseboats, and serene beauty.",
          "cards": [
            "Heaven on Earth: Kashmir is globally recognized for its scenic beauty, with snow-clad mountains and lakes.",
            "Dal Lake & Houseboats: A signature of Kashmir, offering unique stays on water.",
            "Vaishno Devi Temple: A major pilgrimage site attracting millions of devotees every year.",
            "Pashmina Wool: The world-famous Pashmina shawls are made here from fine goat hair.",
            "Two Capitals: Jammu and Srinagar function as the winter and summer capitals respectively.",
            "Revoked Special Status: J&K became a Union Territory in 2019 after Article 370 was repealed."
          ],
          "quizLink": ""
        },
        "ladakh": {
          "title": "Ladakh - GeoLearn",
          "videoUrl": "https://www.youtube.com/embed/G7Ht44BEXOY",
          "info": "Ladakh, carved out of Jammu and Kashmir in 2019, is a Union Territory known for its stark mountains, Buddhist monasteries, and high-altitude desert beauty. It is sparsely populated but culturally rich, influenced heavily by Tibetan Buddhism. The capital Leh serves as the heart of Ladakh's tourism and culture.",
          "cards": [
            "Land of High Passes: Ladakh is renowned for its dramatic mountain passes like Khardung La.",
            "Buddhist Monasteries: Home to ancient monasteries like Hemis and Thiksey.",
            "Pangong Lake: A high-altitude lake that changes colors and attracts tourists worldwide.",
            "Cold Desert: It receives very little rainfall and has a unique desert-like terrain at high altitude.",
            "Festivals and Culture: Colorful festivals and masked dances reflect its vibrant Tibetan heritage.",
            "Union Territory Since 2019: Became a separate UT following the split from J&K."
          ],
          "quizLink": ""
        },
        "puducherry": {
          "title": "Puducherry - GeoLearn",
          "videoUrl": "https://www.youtube.com/embed/pzLe6IPi6lY",
          "info": "Puducherry (formerly Pondicherry) is a Union Territory with a strong French colonial influence, reflected in its architecture, culture, and cuisine. It consists of four scattered districts: Puducherry, Karaikal, Mahe, and Yanam. Known for its beaches, spiritual centers, and calm atmosphere, Puducherry is a popular retreat destination.",
          "cards": [
            "French Connection: The French ruled Puducherry until 1954, and their legacy remains visible.",
            "Auroville: An experimental township promoting human unity and spiritual growth.",
            "Scattered Territories: Puducherry comprises non-contiguous regions across South India.",
            "Bilingual Culture: Tamil and French are widely spoken, and French-style street names are common.",
            "Colonial Architecture: Features old villas, churches, and tree-lined boulevards.",
            "Serene Beaches: Promenade Beach and Paradise Beach attract tourists all year round."
          ],
          "quizLink": ""
        },
        "lakshadweep": {
          "title": "Lakshadweep - GeoLearn",
          "videoUrl": "https://www.youtube.com/embed/Nem9_rPsqKQ",
          "info": "Lakshadweep is India’s smallest Union Territory, comprising 36 islands in the Arabian Sea. Known for its lagoons, coral reefs, and marine biodiversity, it is a remote paradise. The UT is culturally linked to Kerala, with Malayalam and Mahl spoken by the locals. It plays a key role in India’s oceanic security and ecological conservation.",
          "cards": [
            "Coral Atolls: Lakshadweep is made up entirely of coral atolls and reefs.",
            "Smallest UT: It is the smallest in area and population among Indian Union Territories.",
            "Marine Biodiversity: Rich in marine life, it is ideal for scuba diving and snorkeling.",
            "No Alcohol Zone: Consumption of alcohol is restricted on most islands.",
            "Islamic Culture: The population is predominantly Muslim with strong cultural ties to Kerala.",
            "Kavaratti: The administrative capital and the most developed island."
          ],
          "quizLink": ""
        },
        "dadraandnagarhavelianddamananddiu": {
          "title": "Dadra and Nagar Haveli and Daman and Diu - GeoLearn",
          "videoUrl": "https://www.youtube.com/embed/XfUEED_r8pw",
          "info": "This Union Territory is a merger of two former UTs—Dadra and Nagar Haveli and Daman and Diu—in 2020. It is located on the western coast of India and known for its scenic beaches, Portuguese heritage, and tribal culture. The administrative headquarters is in Daman.",
          "cards": [
            "Merged in 2020: Created by merging Dadra & Nagar Haveli with Daman & Diu for administrative efficiency.",
            "Portuguese Legacy: Strong influence of Portuguese rule, especially in Diu and Daman.",
            "Silvassa – Tribal Hub: Silvassa is known for its tribal heritage and lush greenery.",
            "Tourism Hotspots: Devka Beach, Jampore Beach, and St. Paul’s Church are popular sites.",
            "Industrial Development: The region has developed as an industrial hub due to tax benefits.",
            "Cultural Diversity: A blend of Gujarati, Maharashtrian, and tribal traditions."
          ],
          "quizLink": ""
        }
      }
      
  
  